=begin
    Массивы
    -- (+) добавление элементов 
    -- (-) удаление элементов
    -- (*n) умножение(дублирование) эелементов

    - !Разнотипные элементы [1, 2.34, 'a', 'String!'..]
=end

nums = [1, 1, 'a', 2, 3, 'Github', 72]            
nums += [44]                            # добавляем елемент(ы) в массив
sec_nums = nums + [5, 6]                # [1, 1, 'a', 2, 3, 'Github', 72, 44, 5, 6]   
third_nums = sec_nums - [1, 3, 12]      # ['a', 2, 'Github', 72, 44, 5, 6]
                                        # ...игнорирует [12]

p [nums[0], nums, sec_nums, third_nums, [1, 2.3, 'Boom!'] * 2]